name: "dental_segmentator"
backend: "python"
max_batch_size: 0

input [
  {
    name: "image"
    data_type: TYPE_FP32
    dims: [ -1, -1, -1, -1 ]
  },
  {
    name: "spacing"
    data_type: TYPE_FP32
    dims: [ 3 ]
  }
]

output [
  {
    name: "segmentation"
    data_type: TYPE_UINT8
    dims: [ -1, -1, -1 ]
  }
]

instance_group [
  {
    kind: KIND_CPU
    count: 1
  }
]